wucool/fds_test/MC-D1/nrf52832/libraries/crypto/nrf_crypto_keys.h
/* Copyright (c) 2016 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */
#ifndef NRF_CRYPTO_KEYS_H__
#define NRF_CRYPTO_KEYS_H__

/** @file
 *
 * @defgroup nrf_crypto_keys ECC key handling functions.
 * @{
 * @ingroup nrf_crypto
 *
 * @brief Provides functions to allocate, free, generate and convert ECC key types.
 */

#include <stdint.h>
#include "nrf_crypto_types.h"

#include "sdk_config.h"
#if NRF_CRYPTO_BACKEND_CC310_LIB
#include "cc310_lib_keys.h"
#endif

#if NRF_CRYPTO_BACKEND_MICRO_ECC
#include "micro_ecc_lib_keys.h"
#endif


#ifdef __cplusplus
extern "C" {
#if 0
}
#endif
#endif


/**  @brief Internal macro to calculate size required to hold a ECC private key
 *          given curve type(domain), according to the used nrf_crypto backend.
 *
 *  @warning The size representation by running this macro is described by the
 *           memory requirements of the nrf_crypto backend. This size does not
 *           correspond to the size required to hold a raw key.
 * @param[in]   type  Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                    SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 */
#if defined(NRF_CRYPTO_BACKEND_CC310_LIB) && (NRF_CRYPTO_BACKEND_CC310_LIB == 1)

#define NRF_CRYPTO_ECC_PRIVATE_KEY_SIZE(type)                       \
    (NRF_CRYPTO_ECC_PRIVATE_KEY_MAX_SIZE)

#else

#define NRF_CRYPTO_ECC_PRIVATE_KEY_SIZE(type)                       \
    (STRING_CONCATENATE(NRF_CRYPTO_ECC_PRIVATE_KEY_SIZE_, type))

#endif // defined(NRF_CRYPTO_BACKEND_CC310_LIB)


/**  @brief Internal macro to calculate size required to hold a ECC public key
 *          given curve type(domain), according to the used nrf_crypto backend.
 *
 *  @warning The size representation by running this macro is described by the
 *           memory requirements of the nrf_crypto backend. This size does not
 *           correspond to the size required to hold a raw key.
 *
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 */
#if defined(NRF_CRYPTO_BACKEND_CC310_LIB) && (NRF_CRYPTO_BACKEND_CC310_LIB == 1)

#define NRF_CRYPTO_ECC_PUBLIC_KEY_SIZE(type)                       \
    (NRF_CRYPTO_ECC_PUBLIC_KEY_MAX_SIZE)

#else

#define NRF_CRYPTO_ECC_PUBLIC_KEY_SIZE(type)                       \
    (STRING_CONCATENATE(NRF_CRYPTO_ECC_PUBLIC_KEY_SIZE_, type))

#endif // defined(NRF_CRYPTO_BACKEND_CC310_LIB)

/** @brief Macro to create an instance of an ECC private key
 *         given name and type.
 *
 * @note    This creates the value length structure used for Nordic APIs with a buffer
 *          to hold the actual ECC private key data. The ECC private key type is opaque and
 *          the size and format of the data is dependant on the nrf_crypto backend.
 *
 * @note    To convert this key to a raw representation required for external APIS, please
 *          use the function @ref nrf_crypto_ecc_public_key_to_raw.
 *          This may not be supported by all nrf_crypto backends.
 *
 * @param[in]   name    Name of the ECC private key instance.
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 */
#define NRF_CRYPTO_ECC_PRIVATE_KEY_CREATE(name, type)                                   \
__ALIGN(4) static uint8_t                                                               \
    name ## _buffer[NRF_CRYPTO_ECC_PRIVATE_KEY_SIZE(type)];                             \
nrf_value_length_t name =                                                               \
{                                                                                       \
    .p_value = name ## _buffer,                                                         \
    .length = NRF_CRYPTO_ECC_PRIVATE_KEY_SIZE(type)                                     \
}


/** @brief Macro to create an instance of an ECC public key by a given name and type.
 *
 * @note    This creates the value length structure used for Nordic APIs with a buffer
 *          to hold the actual ECC public key data. The ECC public key type is opaque and
 *          the size and format of the data is dependant on the nrf_crypto backend.
 *
 * @note    To convert this key to a raw representation required for external APIS, please
 *          use the function @ref nrf_crypto_ecc_public_key_to_raw.
 *          This may not be supported by all nrf_crypto backends.
 *
 * @param[in]   name    Name of the ECC PUBLIC key instance.
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 */
#define NRF_CRYPTO_ECC_PUBLIC_KEY_CREATE(name, type)                                    \
__ALIGN(4) static uint8_t                                                               \
    name ## _buffer[NRF_CRYPTO_ECC_PUBLIC_KEY_SIZE(type)];                              \
nrf_value_length_t name =                                                               \
{                                                                                       \
    .p_value = name ## _buffer,                                                         \
    .length = NRF_CRYPTO_ECC_PUBLIC_KEY_SIZE(type)                                      \
}


/**  @brief Internal macro to calculate size required to hold a ECC private key
 *          in raw format given curve type(domain), according to the used
 *          nrf_crypto backend.
 *
 *  @warning The size representation by running this macro is described by the
 *           memory requirements of the nrf_crypto backend. This size does not
 *           correspond to the size required to hold a raw key.
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 */

#define NRF_CRYPTO_ECC_PRIVATE_RAW_KEY_SIZE(type)                       \
    (STRING_CONCATENATE(NRF_CRYPTO_ECC_PRIVATE_KEY_SIZE_, type))


/**  @brief Internal macro to calculate size required to hold a ECC public key
 *          in raw representatio given curve type(domain),
 *          according to the used nrf_crypto backend.
 *
 *  @warning The size representation by running this macro is described by the
 *           memory requirements of the nrf_crypto backend. This size does not
 *           correspond to the size required to hold a raw key.
 *
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 */
#define NRF_CRYPTO_ECC_PUBLIC_RAW_KEY_SIZE(type)                       \
    (STRING_CONCATENATE(NRF_CRYPTO_ECC_PUBLIC_KEY_SIZE_, type))


/** @brief  Macro to create an instance of a raw representation of an ECC private key
 *          given name and type.
 *
 * @note    This creates the value length structure used for external APIs that require
 *          an aligned version of a private key where curve-domain and endianness is
 *          described elsewhere.
 *
 * @warning The raw private key can not be used directly in the nrf_crypto APIs.
 *
 * @warning The output of this macro is subject to change.
 *
 * @param[in]   name    Name of the ECC private key instance.
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 */
#define NRF_CRYPTO_ECC_PRIVATE_KEY_RAW_CREATE(name, type)                               \
__ALIGN(4) static uint8_t                                                               \
    name ## _buffer[NRF_CRYPTO_ECC_PRIVATE_RAW_KEY_SIZE(type)];                         \
nrf_value_length_t name =                                                               \
{                                                                                       \
    .p_value = name ## _buffer,                                                         \
    .length = NRF_CRYPTO_ECC_PRIVATE_RAW_KEY_SIZE(type)                                 \
}


/** @brief  Macro to create a value length structure to represent a raw ECC private key
 *          by a given name, type and an uint8_t array buffer to hold the raw private key.
 *  If the input is not of the correct size a static assert will be occur compile-time.
 *
 *
 * @note    This creates the value length structure used for external APIs that require
 *          an aligned version of a private key where curve-domain and endianness is
 *          described elsewhere.
 *
 * @note    The value length pair generated by running this macro can be used as input in the
 *          function @ref nrf_crypto_ecc_private_key_to_raw to hold a raw private key type.
 *
 * @warning There is no API function to convert private key from a raw representation in the
 *          nrf_crypto CryptoCell (cc310) backend. Running this macro while nrf_crypto
 *          CryptoCell backend is enabled will cause a static assertion.
 *
 * @param[in]   name    Name of the ECC private key instance.
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 * @param[in]   input   Array holding the private key.
 */
#define NRF_CRYPTO_ECC_PRIVATE_KEY_RAW_CREATE_FROM_ARRAY(name, type, input)             \
STATIC_ASSERT(sizeof(input) == NRF_CRYPTO_ECC_PRIVATE_RAW_KEY_SIZE(type))               \
static nrf_value_length_t name =                                                        \
{                                                                                       \
    .p_value = (uint8_t*)input,                                                         \
    .length = NRF_CRYPTO_ECC_PRIVATE_RAW_KEY_SIZE(type)                                 \
}

/** @brief Macro to create an instance of a araw representation of an ECC public key
 *         given name and type.
 *
 * @note    This creates the value length structure used for external APIs that require
 *          an aligned version of a public key where curve-domain and endianness is
 *          described elsewhere.
 *
¨* @note    The value length pair generated by running this macro can be used as input in the
 *          function @ref nrf_crypto_ecc_public_key_to_raw to hold a raw private key type.
 *
 * @param[in]   name    Name of the ECC PUBLIC key instance.
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 */
#define NRF_CRYPTO_ECC_PUBLIC_KEY_RAW_CREATE(name, type)                                \
__ALIGN(4) static uint8_t                                                               \
    name ## _buffer[NRF_CRYPTO_ECC_PUBLIC_RAW_KEY_SIZE(type)];                          \
nrf_value_length_t name =                                                               \
{                                                                                       \
    .p_value = name ## _buffer,                                                         \
    .length = NRF_CRYPTO_ECC_PUBLIC_RAW_KEY_SIZE(type)                                  \
}


