wucool/fds_test/MC-D1/nrf52832/libraries/crypto/nrf_crypto_keys.h
/** @brief Macro to create an instance of an ECC public key by a given
 *         name, type and array input.
 *  If the input is not of the correct size a static assert will be occur compile-time.
 *
 *
 * @note    This creates the value length structure used for external APIs that require
 *          an aligned version of a private key where curve-domain and endianness is
 *          described elsewhere.
 *
 * @note    The value length pair generated by running this macro can be used as input in the
 *          function @ref nrf_crypto_ecc_private_key_to_raw to hold a raw public key type.
 *
 * @param[in]   name    Name of the ECC PUBLIC key instance.
 * @param[in]   type    Curve type. Either SECP192R1, SECP224R1, SECP256R1, SECP384R1,
 *                      SECP521R1, SECP192K1, SECP224K1, or SECP256K1.
 * @param[in]   input   Array of data used as the buffer.
 */
#define NRF_CRYPTO_ECC_PUBLIC_KEY_RAW_CREATE_FROM_ARRAY(name, type, input)              \
STATIC_ASSERT(sizeof(input) == NRF_CRYPTO_ECC_PUBLIC_RAW_KEY_SIZE(type));               \
static nrf_value_length_t name =                                                        \
{                                                                                       \
    .p_value = (uint8_t*)input,                                                         \
    .length = NRF_CRYPTO_ECC_PUBLIC_RAW_KEY_SIZE(type)                                  \
}

/**@brief Function to get the private key size given curve_type.
 *
 * @param[in]       curve_type  Curve type to get private key size for.
 * @param[in,out]   p_key_size  Pointer to variable to hold the private key size.
 *
 * @retval  NRF_SUCCESS             If the private key size was successfully found.
 * @retval  NRF_ERROR_NULL          If the p_key_size was NULL.
 * @retval  NRF_ERROR_NOT_SUPPORTED If the curve type was not supported.
 */
uint32_t nrf_crypto_ecc_private_key_size_get(nrf_ecc_curve_type_t   curve_type,
                                             uint32_t             * p_key_size);


/**@brief Function to get the public key size given curve_type.
 *
 * @param[in]       curve_type  Curve type to get public key size for.
 * @param[in,out]   p_key_size  Pointer to variable to hold the public key size.
 *
 * @retval  NRF_SUCCESS             If the public key size was successfully found.
 * @retval  NRF_ERROR_NULL          If the p_key_size was NULL.
 * @retval  NRF_ERROR_NOT_SUPPORTED If the curve type was not supported.
 */
uint32_t nrf_crypto_ecc_public_key_size_get(nrf_ecc_curve_type_t    curve_type,
                                            uint32_t              * p_key_size);


/**@brief Function to allocate dynamic memory for holding a ECC private key.
 *
  * @note   Memory dynamically allocated by calling this function will be aligned to a
 *          uint32_t address.
 *
 * @param[in]       curve_info      Curve type used for ECC private key.
 * @param[in,out]   p_private_key   Pointer to a value length structure to hold a private key.
 * @param[in]       p_raw_key       Pointer to value length structure holding raw
 *                                  representation of a private key taken as input.
 *                                  If this is set to NULL, no initialization will take place.
 *
 * @retval  NRF_SUCCESS     If memory for the private key was successfully allocated.
 * @retval  NRF_ERROR_NULL  If p_private_key was NULL.
 * @retval  Any other error code reported by the memory manager.
 */
uint32_t nrf_crypto_ecc_private_key_allocate(nrf_crypto_curve_info_t    curve_info,
                                             nrf_value_length_t       * p_private_key,
                                             nrf_value_length_t const * p_raw_key);


/**@brief Function to free allocated memory for ECC private key.
 *
 * @note    Memory dynamically allocated by calling this function will be aligned to a
 *          uint32_t address.
 *
 * @param[in]   p_private_key   Pointer to structure holdign
 *

 * @retval  NRF_SUCCESS     if memory for the private key was successfully freed.
 * @retval  NRF_ERROR_NULL  If p_private_key was NULL.
 * @retval  Any other error code reported by the memory manager.
 */
uint32_t nrf_crypto_ecc_private_key_free(nrf_value_length_t * p_private_key);


/**@brief Function to allocate dynamic memory for holdign a ECC public key.
 *
 * @param[in]       curve_info      Curve type used for ECC public key.
 * @param[in,out]   p_public_key    Pointer to a value length structure to hold a public key.
 * @param[in]       p_raw_key       Pointer to value length structure holding raw
 *                                  representation of a public key taken as input.
 *                                  If this is set to NULL, no initialization will take place.
 *
 * @retval  NRF_SUCCESS     If memory for the public key was successfully allocated.
 * @retval  NRF_ERROR_NULL  If p_public_key was NULL.
 * @retval  Any other error code reported by the memory manager.
 */
uint32_t nrf_crypto_ecc_public_key_allocate(nrf_crypto_curve_info_t     curve_info,
                                            nrf_value_length_t       * p_public_key,
                                            nrf_value_length_t const * p_raw_key);


/**@brief Function to free allocated memory for ECC private key.
 *
 * @param[in]   p_public_key    Pointer to value length structure holding public key to free.
 *
 * @retval  NRF_SUCCESS     If memory for the public key was successfully freed.
 * @retval  NRF_ERROR_NULL  If p_public_key was NULL.
 * @retval  Any other error code reported by the memory manager.
 */
uint32_t nrf_crypto_ecc_public_key_free(nrf_value_length_t * p_public_key);


/**@brief Function to generate ECC private public keypair given curve type.
 *
 * @note    This function will not allocate any memory. Private and public keys given as
 *          input must be pointing to previously allocated memory.
 *
 * @note    This function needs RNG functionality. See @ref NRF_CRYPTO_SUPPORTS_RNG for the
 *          nrf_crypto backends that require external source of RNG data.
 *
 * @param[in]       curve_info      Curve type used for key pair generation.
 * @param[in,out]   p_private_key   Pointer to a value length structure to hold a private key.
 * @param[in,out]   p_public_key    Pointer to a value length structure to hold a public key.
 *
 * @retval  NRF_SUCCESS                 The ECC key pair was generated successfully.
 * @retval  NRF_ERROR_INVALID_STATE     If the function was called when nrf_crypto was
 *                                      uninitialized.
 * @retval  NRF_ERROR_NULL              If the any of the parameters was NULL.
 * @retval  NRF_ERROR_INVALID_ADDR      If any of the provided pointers are invalid.
 * @retval  NRF_ERROR_INVALID_LENGTH    If the key pair size is different to the provided buffers.
 * @retval  NRF_ERROR_NOT_SUPPORTED     If the key pair generation is not supported for the given curve type.
 * @retval  NRF_ERROR_INTERNAL          Unexpected error. Possibly because @ref NRF_CRYPTO_SUPPORTS_RNG is 0.
 */
uint32_t nrf_crypto_ecc_key_pair_generate(nrf_crypto_curve_info_t       curve_info,
                                          nrf_value_length_t          * p_private_key,
                                          nrf_value_length_t          * p_public_key);


/**@brief Function to calculate ECC public key given a ECC private key as input
 *
 * @note    This function will not allocate any memory. The public key given as input
 *          must be pointing to previously allocated memory.
 *
 * @param[in]       curve_info      Curve type used for public key.
 * @param[in]       p_private_key   Pointer to a value length structure holding a private key.
 * @param[in, out]  p_public_key    Pointer to a value length structure to hold the calculated
 *                                  key.
 *
 * @retval  NRF_SUCCESS                 If the public key was calculated successfully.
 * @retval  NRF_ERROR_INVALID_STATE     If the function was called when nrf_crypto was
 *                                      uninitialized.
 * @retval  NRF_ERROR_NULL              If the any of the parameters was NULL.
 * @retval  NRF_ERROR_INVALID_ADDR      If any of the provided pointers are invalid.
 * @retval  NRF_ERROR_INVALID_LENGTH    If the key pair size is different to the provided buffers.
 * @retval  NRF_ERROR_NOT_SUPPORTED     If the public key calculation is not supported.
 */
uint32_t nrf_crypto_ecc_public_key_calculate(nrf_crypto_curve_info_t       curve_info,
                                             nrf_value_length_t    const * p_private_key,
                                             nrf_value_length_t          * p_public_key);


